src/cf/Documents/ПриказНаЗакреплениеАгентовЗаМенеджером.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>ПриказНаЗакреплениеАгентовЗаМенеджером</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЗакреплениеАгентовЗаМенеджерами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Агенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Агент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Агенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/ЗакреплениеАгентовЗаМенеджерами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ЗакреплениеАгентовЗаМенеджерами</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Агенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/ПриказНаЗакреплениеАгентовЗаМенеджером/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ЗакреплениеАгентовЗаМенеджерами
	Движения.ЗакреплениеАгентовЗаМенеджерами.Записывать = Истина;
	Для Каждого ТекСтрокаАгенты Из Агенты Цикл
		Движение = Движения.ЗакреплениеАгентовЗаМенеджерами.Добавить();
		Движение.Период = Дата;
		Движение.Агент = ТекСтрокаАгенты.Агент;
		Движение.Менеджер = Менеджер;
	КонецЦикла;

	
КонецПроцедуры
